
#Область ОбработчикиСобытий

// Обработка команды.
// 
// Параметры:
//  ПараметрКоманды - Произвольный - Параметр команды
//  ПараметрыВыполненияКоманды - ПараметрыВыполненияКоманды - Параметры выполнения команды
&НаКлиенте
Асинх Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//TODO: Вставить содержимое обработчика.
	//ПараметрыФормы = Новый Структура("", );
	//ОткрытьФорму("ОбщаяФорма.", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
	ВведеннаяСТрока = Ждать ВвестиСтрокуАсинх("", "Напиши 3 цифры с оборота карты");
	
	Если НЕ ПустаяСтрока(ВведеннаяСТрока) Тогда
		Сообщить("ха-ха лошара");
	Иначе
		Сообщить("не лох");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти