
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	URIПространстваИменСервиса = "http://localhost/testpacket";
	АдресWSDL = "http://localhost/Demo/ws/ws2.1cws?wsdl";  
	ИмяСервиса = "TestWebServer";
	ИмяТочкиПодключения = "TestWebServerSoap";    
	
КонецПроцедуры

&НаКлиенте
Процедура PostSmth(Команда)
	
	PostSmthНаСервере();	
	
КонецПроцедуры

Процедура PostSmthНаСервере()

	Определение = Новый WSОпределения(АдресWSDL,"Администратор","");
	Соедиенение = Новый WSПрокси(Определение,URIПространстваИменСервиса,ИмяСервиса,ИмяТочкиПодключения);
	Соедиенение.Пользователь = "Администратор"; 
	Соедиенение.Пароль = "";  
	
	ФабрикаЗапрос = Соедиенение.ФабрикаXDTO;
	
	ТипXDTOОбъект = ФабрикаЗапрос.Тип("http://localhost/testpacket","ObjectTestExtended");	
	ЭкземплярОбъект = ФабрикаЗапрос.Создать(ТипXDTOОбъект);
	ЭкземплярОбъект.Code = Code;
	ЭкземплярОбъект.Name = Name;  
	
	ТипXDTOСвойства = ФабрикаЗапрос.Тип("http://localhost/testpacket","AdditionalProperty");	
	ЭкземплярСвойства = ФабрикаЗапрос.Создать(ТипXDTOСвойства);
	ЭкземплярСвойства.Property = "111";
	ЭкземплярСвойства.Type = "property_1";    
	ЭкземплярОбъект.ExtendedProperties.Добавить(ЭкземплярСвойства);

	ЭкземплярСвойства = ФабрикаЗапрос.Создать(ТипXDTOСвойства);
	ЭкземплярСвойства.Property = "222";
	ЭкземплярСвойства.Type = "property_2";
	ЭкземплярОбъект.ExtendedProperties.Добавить(ЭкземплярСвойства); 
	
	Ответ = Соедиенение.PostSmth(ЭкземплярОбъект); 
	Сообщить(Ответ.Sucesfull);
	Для каждого Error Из Ответ.Errors Цикл
		Сообщить(Error);	
	КонецЦикла;


КонецПроцедуры

&НаКлиенте
Процедура GetSmth(Команда)
	
	GetSmthНаСервере();
	
КонецПроцедуры

Процедура GetSmthНаСервере()
	
	Соедиенение = WSСсылки.WSСсылкаTest.СоздатьWSПрокси(URIПространстваИменСервиса,ИмяСервиса,ИмяТочкиПодключения);
	Соедиенение.Пользователь = "Администратор"; 
	Соедиенение.Пароль = "";

	Ответ = Соедиенение.GetSmth(Code,Name); 
	
	Сообщить(Ответ.Sucesfull);
	Для каждого Error Из Ответ.Errors Цикл
		Сообщить(Error);	
	КонецЦикла;

КонецПроцедуры

