
Процедура Заполнить(ДатаНачала, ДатаОкончания, ВыходныеДни, График) Экспорт
	
	Набор = РегистрыСведений.ГрафикиРаботы.СоздатьНаборЗаписей();
	Набор.Отбор.ГрафикРаботы.Установить(График);
	Набор.Прочитать();
	
	ДеньВСекундах = 86400;

	Дат = ДатаНачала;
	
	Для инд=1 По Набор.Количество()-1 Цикл	
		Запись = Набор[инд];	
		Если Запись.Дата<ДатаНачала Тогда
			Продолжить;
		ИначеЕсли Запись.Дата = Дат Тогда 
			Если СтрНайти(ВыходныеДни, Строка(ДеньНедели(Дат)))>0 Тогда
				Запись.Дни = 0;
				Запись.Часы = 0;
			Иначе
				Запись.Дни = 1;
				Запись.Часы = 8;
			КонецЕсли;
			Дат = Дат + ДеньВСекундах;
		Иначе
			Пока Дат<Мин(Запись.Дата,ДатаОкончания) Цикл
				НоваяЗапись = Набор.Добавить();
				НоваяЗапись.Дата = Дат;
				НоваяЗапись.ГрафикРаботы = График;
				Если СтрНайти(ВыходныеДни, Строка(ДеньНедели(Дат)))>0 Тогда
					НоваяЗапись.Дни = 0;
					НоваяЗапись.Часы = 0;
				Иначе
					НоваяЗапись.Дни = 1;
					НоваяЗапись.Часы = 8;
				КонецЕсли;
				Дат = Дат + ДеньВСекундах;
			КонецЦикла; 
			Если Запись.Дата > ДатаОкончания Тогда
				Прервать;
			Иначе
				Если СтрНайти(ВыходныеДни, Строка(ДеньНедели(Дат))) > 0 Тогда
					Запись.Дни = 0;
					Запись.Часы = 0;
				Иначе
					Запись.Дни = 1;
					Запись.Часы = 8;
				КонецЕсли;
			КонецЕсли;
			Дат = Дат + ДеньВСекундах;
		КонецЕсли;			
	КонецЦикла;	
	Набор.Записать();
		
	Пока Дат <= ДатаОкончания Цикл
		НоваяЗапись = Набор.Добавить();
		НоваяЗапись.Дата = Дат;
		НоваяЗапись.ГрафикРаботы = График;
		Если СтрНайти(ВыходныеДни, Строка(ДеньНедели(Дат))) > 0 Тогда
			НоваяЗапись.Дни = 0;
			НоваяЗапись.Часы = 0;
		Иначе
			НоваяЗапись.Дни = 1;
			НоваяЗапись.Часы = 8;
		КонецЕсли;
		Дат = Дат + ДеньВСекундах;
	КонецЦикла;
	Набор.Записать();
	
КонецПроцедуры