
Функция GetSmth(Code, Name)
	
	Попытка
		ЗаписьНачало = РегистрыСведений.ЖурналЗаписейИнтегарций.СоздатьМенеджерЗаписи();
		ЗаписьНачало.Период = ТекущаяДатаСеанса();
		ЗаписьНачало.ИмяСервиса = "TestWebServer";
		ЗаписьНачало.ВидСервиса = Перечисления.ВидыСервисовИнтеграций.Web;
		ЗаписьНачало.ВходящийЗапрос = Code+Name;
		ЗаписьНачало.ИдентиифкаторЗаписи = Новый УникальныйИдентификатор();
		ЗаписьНачало.Записать();
	Исключение
		ЗаписьЖурналаРегистрации("Запись регистра ЖурналЗаписейИнтегарций НачалоЗаписи",УровеньЖурналаРегистрации.Ошибка,
			,Code+Name,ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	///////////////////////////////////
	
	ТипОбъект = ФабрикаXDTO.Тип("http://localhost/testpacket","ObjectTest");
	
	ЭкземплярОбъекта = ФабрикаXDTO.Создать(ТипОбъект);
	ЭкземплярОбъекта.Code = Code;
	ЭкземплярОбъекта.Name = Name; 
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	ФабрикаXDTO.ЗаписатьXML(ЗаписьXML,ЭкземплярОбъекта);
	СтрокаXML = ЗаписьXML.Закрыть();
	
	ТипОтвет = ФабрикаXDTO.Тип("http://localhost/testpacket","Answer");
	ЭкземплярОтвета = ФабрикаXDTO.Создать(ТипОтвет);
	ЭкземплярОтвета.Sucesfull = Истина;
	ЭкземплярОтвета.Errors.Добавить(СериализаторXDTO.ЗаписатьXDTO(""));
	
	/////////////////////////////////////
	
	Попытка
		ЗаписьКонец = РегистрыСведений.ЖурналЗаписейИнтегарций.СоздатьМенеджерЗаписи();
		ЗаписьКонец.Период = ЗаписьНачало.Период;
		ЗаписьКонец.ИдентиифкаторЗаписи = ЗаписьНачало.ИдентиифкаторЗаписи;
		ЗаписьКонец.Прочитать();
		Если ЗаписьКонец.Выбран() Тогда
			ЗаписьКонец.Ответ = СтрокаXML;
			ЗаписьКонец.Записать();	
		КонецЕсли;	
	Исключение
		ЗаписьЖурналаРегистрации("Запись регистра ЖурналЗаписейИнтегарций КонецЗаписи",УровеньЖурналаРегистрации.Ошибка,
			,Code+Name,ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	Возврат ЭкземплярОтвета
	
КонецФункции

Функция PostSmth(ObjectExtended)
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	ФабрикаXDTO.ЗаписатьXML(ЗаписьXML,ObjectExtended);
	СтрокаXMLВх = ЗаписьXML.Закрыть();
	
	Попытка
		ЗаписьНачало = РегистрыСведений.ЖурналЗаписейИнтегарций.СоздатьМенеджерЗаписи();
		ЗаписьНачало.Период = ТекущаяДатаСеанса();
		ЗаписьНачало.ИмяСервиса = "TestWebServer";
		ЗаписьНачало.ВидСервиса = Перечисления.ВидыСервисовИнтеграций.Web;
		ЗаписьНачало.ВходящийЗапрос = СтрокаXMLВх;
		ЗаписьНачало.ИдентиифкаторЗаписи = Новый УникальныйИдентификатор();
		ЗаписьНачало.Записать();
	Исключение
		ЗаписьЖурналаРегистрации("Запись регистра ЖурналЗаписейИнтегарций НачалоЗаписи",УровеньЖурналаРегистрации.Ошибка,
			,СтрокаXMLВх,ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;

	///////////////////////////////////
	
	ТипОбъект = ФабрикаXDTO.Тип("http://localhost/testpacket","AdditionalProperty");	
	AdditionalProperty = ФабрикаXDTO.Создать(ТипОбъект);
	AdditionalProperty.Property = Строка(ТекущаяДатаСеанса());
	AdditionalProperty.Type = "date"; 
	ObjectExtended.ExtendedProperties.Добавить(AdditionalProperty);
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	ФабрикаXDTO.ЗаписатьXML(ЗаписьXML,ObjectExtended);
	СтрокаXMLВых = ЗаписьXML.Закрыть();

	ТипОтвет = ФабрикаXDTO.Тип("http://localhost/testpacket","Answer");
	ЭкземплярОтвета = ФабрикаXDTO.Создать(ТипОтвет);
	ЭкземплярОтвета.Sucesfull = Истина;
	ЭкземплярОтвета.Errors.Добавить(СериализаторXDTO.ЗаписатьXDTO(""));
	
	///////////////////////////////////
	
	Попытка
		ЗаписьКонец = РегистрыСведений.ЖурналЗаписейИнтегарций.СоздатьМенеджерЗаписи();
		ЗаписьКонец.Период = ЗаписьНачало.Период;
		ЗаписьКонец.ИдентиифкаторЗаписи = ЗаписьНачало.ИдентиифкаторЗаписи;
		ЗаписьКонец.Прочитать();
		Если ЗаписьКонец.Выбран() Тогда
			ЗаписьКонец.Ответ = СтрокаXMLВых;
			ЗаписьКонец.Записать();	
		КонецЕсли;	
	Исключение
		ЗаписьЖурналаРегистрации("Запись регистра ЖурналЗаписейИнтегарций КонецЗаписи",УровеньЖурналаРегистрации.Ошибка,
			,СтрокаXMLВых,ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
		
	Возврат	ЭкземплярОтвета

КонецФункции
